// Завдання 7: Конструкція switch statement
// 1) Створіть змінну dayNumber від 1 до 7.
// 2) Використайте switch, щоб вивести:
//   Понеділок, Вівторок, …, Неділя.
// 3) Якщо день не від 1 до 7 — вивести “Невірний номер дня”.
// 4) Додатково: для вихідних (6, 7) вивести “Вихідний день 🎉”.

void main() {
  int dayNumber = 5;
  String day = switch (dayNumber) {
    1 => 'Понеділок',
    2 => 'Вівторок',
    3 => 'Середа',
    4 => 'Четвер',
    5 => 'П\'ятниця',
    6 => 'Субота',
    7 => 'Неділя',
    _ => throw FormatException('Невірний номер дня'),
  };

  print(day);

  switch (dayNumber) {
    case 6 || 7:
      print('Вихідний день 🎉');
  }
}
